In [1]:
import pandas as pd

# concat으로 데이터 합치기

In [2]:
df1 = pd.DataFrame({'A': [1,3,5,7,9],
                    'B': [11,12,13,14,15],
                    'C': [0,1,2,3,4],
                    'D': [101,102,103,104,105]    
},
                  index = [1,2,3,4,5])

df2 = pd.DataFrame({'A': [2,4,6,8,10],
                    'B': [1,2,3,4,5],
                    'C': [30,31,32,33,34],
                    'D': [1011,1021,1031,1041,1051]    
},
                  index = [6,7,8,9,10])

In [3]:
df1

   A   B  C    D
1  1  11  0  101
2  3  12  1  102
3  5  13  2  103
4  7  14  3  104
5  9  15  4  105

In [4]:
df2

     A  B   C     D
6    2  1  30  1011
7    4  2  31  1021
8    6  3  32  1031
9    8  4  33  1041
10  10  5  34  1051

In [5]:
pd.concat([df1, df2])

     A   B   C     D
1    1  11   0   101
2    3  12   1   102
3    5  13   2   103
4    7  14   3   104
5    9  15   4   105
6    2   1  30  1011
7    4   2  31  1021
8    6   3  32  1031
9    8   4  33  1041
10  10   5  34  1051

In [6]:
# index가 일치하지 않아 아래와 같은 모양으로 결합됨
pd.concat([df1,df2], axis = 1)

      A     B    C      D     A    B     C       D
1   1.0  11.0  0.0  101.0   NaN  NaN   NaN     NaN
2   3.0  12.0  1.0  102.0   NaN  NaN   NaN     NaN
3   5.0  13.0  2.0  103.0   NaN  NaN   NaN     NaN
4   7.0  14.0  3.0  104.0   NaN  NaN   NaN     NaN
5   9.0  15.0  4.0  105.0   NaN  NaN   NaN     NaN
6   NaN   NaN  NaN    NaN   2.0  1.0  30.0  1011.0
7   NaN   NaN  NaN    NaN   4.0  2.0  31.0  1021.0
8   NaN   NaN  NaN    NaN   6.0  3.0  32.0  1031.0
9   NaN   NaN  NaN    NaN   8.0  4.0  33.0  1041.0
10  NaN   NaN  NaN    NaN  10.0  5.0  34.0  1051.0

In [7]:
# index 일치시키기
df1.reset_index(drop=True, inplace = True)
df2.reset_index(drop = True, inplace = True)

In [8]:
df1

   A   B  C    D
0  1  11  0  101
1  3  12  1  102
2  5  13  2  103
3  7  14  3  104
4  9  15  4  105

In [9]:
df2

    A  B   C     D
0   2  1  30  1011
1   4  2  31  1021
2   6  3  32  1031
3   8  4  33  1041
4  10  5  34  1051

In [10]:
pd.concat([df1, df2], axis = 1)

   A   B  C    D   A  B   C     D
0  1  11  0  101   2  1  30  1011
1  3  12  1  102   4  2  31  1021
2  5  13  2  103   6  3  32  1031
3  7  14  3  104   8  4  33  1041
4  9  15  4  105  10  5  34  1051

# merge로 데이터 합치기

In [11]:
df1 = pd.DataFrame({'id': ['X01','X02','X03','X04','X05'],
                    'A': [1,3,5,7,9],
                    'B': [11,12,13,14,15],
                    'C': [0,1,2,3,4],
                    'D': [101,102,103,104,105]    
})


df2 = pd.DataFrame({'id': ['X01','X02','X03','X04','X06'],
                    'E': [2,4,6,8,10],
                    'F': [1,2,3,4,5],
                    'G': [30,31,32,33,34],
                    'H': [1011,1021,1031,1041,1051]    
})

In [12]:
df1

    id  A   B  C    D
0  X01  1  11  0  101
1  X02  3  12  1  102
2  X03  5  13  2  103
3  X04  7  14  3  104
4  X05  9  15  4  105

In [13]:
df2

    id   E  F   G     H
0  X01   2  1  30  1011
1  X02   4  2  31  1021
2  X03   6  3  32  1031
3  X04   8  4  33  1041
4  X06  10  5  34  1051

In [14]:
pd.merge(df1, df2, on = 'id')

    id  A   B  C    D  E  F   G     H
0  X01  1  11  0  101  2  1  30  1011
1  X02  3  12  1  102  4  2  31  1021
2  X03  5  13  2  103  6  3  32  1031
3  X04  7  14  3  104  8  4  33  1041

In [15]:
pd.merge(df1, df2, on = 'id', how = 'inner')

    id  A   B  C    D  E  F   G     H
0  X01  1  11  0  101  2  1  30  1011
1  X02  3  12  1  102  4  2  31  1021
2  X03  5  13  2  103  6  3  32  1031
3  X04  7  14  3  104  8  4  33  1041

In [16]:
pd.merge(df1, df2, on = 'id', how = 'outer')

    id    A     B    C      D     E    F     G       H
0  X01  1.0  11.0  0.0  101.0   2.0  1.0  30.0  1011.0
1  X02  3.0  12.0  1.0  102.0   4.0  2.0  31.0  1021.0
2  X03  5.0  13.0  2.0  103.0   6.0  3.0  32.0  1031.0
3  X04  7.0  14.0  3.0  104.0   8.0  4.0  33.0  1041.0
4  X05  9.0  15.0  4.0  105.0   NaN  NaN   NaN     NaN
5  X06  NaN   NaN  NaN    NaN  10.0  5.0  34.0  1051.0

In [17]:
pd.merge(df1, df2, on = 'id', how = 'left')

    id  A   B  C    D    E    F     G       H
0  X01  1  11  0  101  2.0  1.0  30.0  1011.0
1  X02  3  12  1  102  4.0  2.0  31.0  1021.0
2  X03  5  13  2  103  6.0  3.0  32.0  1031.0
3  X04  7  14  3  104  8.0  4.0  33.0  1041.0
4  X05  9  15  4  105  NaN  NaN   NaN     NaN

In [18]:
pd.merge(df1, df2, on = 'id', how = 'right')

    id    A     B    C      D   E  F   G     H
0  X01  1.0  11.0  0.0  101.0   2  1  30  1011
1  X02  3.0  12.0  1.0  102.0   4  2  31  1021
2  X03  5.0  13.0  2.0  103.0   6  3  32  1031
3  X04  7.0  14.0  3.0  104.0   8  4  33  1041
4  X06  NaN   NaN  NaN    NaN  10  5  34  1051

In [19]:
# 연습을 위해 key 컬럼의 이름 변경
df2 = pd.DataFrame({'user_id': ['X01','X02','X03','X04','X06'],
                    'E': [2,4,6,8,10],
                    'F': [1,2,3,4,5],
                    'G': [30,31,32,33,34],
                    'H': [1011,1021,1031,1041,1051]    
})

In [20]:
# key 컬럼의 이름이 다른 경우
pd.merge(df1, df2, left_on = 'id', right_on='user_id')

    id  A   B  C    D user_id  E  F   G     H
0  X01  1  11  0  101     X01  2  1  30  1011
1  X02  3  12  1  102     X02  4  2  31  1021
2  X03  5  13  2  103     X03  6  3  32  1031
3  X04  7  14  3  104     X04  8  4  33  1041

# join으로 데이터 합치기

In [21]:
df1 = pd.DataFrame({'A': [1,3,5,7,9],
                    'B': [11,12,13,14,15],
                    'C': [0,1,2,3,4],
                    'D': [101,102,103,104,105]    
},
                  index = [1,2,3,4,5])


df2 = pd.DataFrame({'E': [2,4,6,8,10],
                    'F': [1,2,3,4,5],
                    'G': [30,31,32,33,34],
                    'H': [1011,1021,1031,1041,1051]    
},
                  index = [6,7,8,9,10])

In [22]:
df1

   A   B  C    D
1  1  11  0  101
2  3  12  1  102
3  5  13  2  103
4  7  14  3  104
5  9  15  4  105

In [23]:
df2

     E  F   G     H
6    2  1  30  1011
7    4  2  31  1021
8    6  3  32  1031
9    8  4  33  1041
10  10  5  34  1051

In [24]:
# index가 일치하지 않아서 제대로 결합이 안됨
df1.join(df2)

   A   B  C    D   E   F   G   H
1  1  11  0  101 NaN NaN NaN NaN
2  3  12  1  102 NaN NaN NaN NaN
3  5  13  2  103 NaN NaN NaN NaN
4  7  14  3  104 NaN NaN NaN NaN
5  9  15  4  105 NaN NaN NaN NaN

In [25]:
# index 일치 시켜주기
df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)

In [26]:
df1.join(df2)

   A   B  C    D   E  F   G     H
0  1  11  0  101   2  1  30  1011
1  3  12  1  102   4  2  31  1021
2  5  13  2  103   6  3  32  1031
3  7  14  3  104   8  4  33  1041
4  9  15  4  105  10  5  34  1051